{
  "api": {
    "titles": [
      "Зеленая миля",
      "Список Шиндлера",
      "Побег из Шоушенка",
      "Форрест Гамп",
      "Властелин колец: Возвращение короля",
      "Тайна Коко"
    ],
    "descriptions": [
      "Пол Эджкомб — начальник блока смертников в тюрьме «Холодная гора», каждый из узников которого однажды проходит «зеленую милю» по пути к месту казни. Пол повидал много заключённых и надзирателей за время работы. Однако гигант Джон Коффи, обвинённый в страшном преступлении, стал одним из самых необычных обитателей блока.",
      "Фильм рассказывает реальную историю загадочного Оскара Шиндлера, члена нацистской партии, преуспевающего фабриканта, спасшего во время Второй мировой войны почти 1200 евреев.",
      "Бухгалтер Энди Дюфрейн обвинён в убийстве собственной жены и её любовника. Оказавшись в тюрьме под названием Шоушенк, он сталкивается с жестокостью и беззаконием, царящими по обе стороны решётки. Каждый, кто попадает в эти стены, становится их рабом до конца жизни. Но Энди, обладающий живым умом и доброй душой, находит подход как к заключённым, так и к охранникам, добиваясь их особого к себе расположения.",
      "Сидя на автобусной остановке, Форрест Гамп — не очень умный, но добрый и открытый парень — рассказывает случайным встречным историю своей необыкновенной жизни. С самого малолетства парень страдал от заболевания ног, соседские мальчишки дразнили его, но в один прекрасный день Форрест открыл в себе невероятные способности к бегу. Подруга детства Дженни всегда его поддерживала и защищала, но вскоре дороги их разошлись.",
      "Повелитель сил тьмы Саурон направляет свою бесчисленную армию под стены Минас-Тирита, крепости Последней Надежды. Он предвкушает близкую победу, но именно это мешает ему заметить две крохотные фигурки — хоббитов, приближающихся к Роковой Горе, где им предстоит уничтожить Кольцо Всевластья.",
      "12-летний Мигель живёт в мексиканской деревушке в семье сапожников и тайно мечтает стать музыкантом. Тайно, потому что в его семье музыка считается проклятием. Когда-то его прапрадед оставил жену, прапрабабку Мигеля, ради мечты, которая теперь не даёт спокойно жить и его праправнуку. С тех пор музыкальная тема в семье стала табу. Мигель обнаруживает, что между ним и его любимым певцом Эрнесто де ла Крусом, ныне покойным, существует некая связь. Паренёк отправляется к своему кумиру в Страну Мёртвых, где встречает души предков. Мигель знакомится там с духом-скелетом по имени Гектор, который становится его проводником. Вдвоём они отправляются на поиски де ла Круса."
    ],
    "publicationDates": [
      "06.01.2023",
      "05.01.2022",
      "04.01.2021",
      "03.01.2020",
      "02.01.2019",
      "01.01.2018"
    ],
    "releaseYears": [
      "1999",
      "1993",
      "1994",
      "1994",
      "2003",
      "2017"
    ],
    "ratings": [
      5.0,
      4.9,
      4.8,
      4.7,
      4.6,
      4.5
    ],
    "previews": [
      "mile-preview.mp4",
      "list-preview.mp4",
      "shawshank-preview.mp4",
      "forest-preview.mp4",
      "ring-preview.mp4",
      "coco-preview.mp4"
    ],
    "videos": [
      "mile.mp4",
      "list.mp4",
      "shawshank.mp4",
      "forest.mp4",
      "ring.mp4",
      "coco.mp4"
    ],
    "actors": [
      "Том Хэнкс",
      "Дэвид Морс",
      "Лиам Нисон",
      "Бэн Кингсли",
      "Тим Роббинс",
      "Морган Фриман",
      "Том Хэнкс",
      "Робин Райт",
      "Элайджа Вуд",
      "Вигго Мортенсен",
      "Энтони Гонсалес",
      "Гаэль Гарсиа Берналь"
    ],
    "directors": [
      "Фрэнк Дарабонт",
      "Стивен Спилберг",
      "Фрэнк Дарабонт",
      "Роберт Земекис",
      "Питер Джексон",
      "Ли Анкрич"
    ],
    "durationsInMinutes": [
      189,
      195,
      142,
      142,
      201,
      105
    ],
    "commentsCounts": [
      2,
      15,
      6,
      198,
      34,
      7
    ],
    "users": [
      "Альберт Рыбкин",
      "Игорь Мышкин",
      "Василий Пупкин",
      "Дмитрий Слонов",
      "Геннадий Крокодилов",
      "Михаил Мопсов"
    ],
    "emails": [
      "file-o-fish@urfu.me",
      "mouse@yandex.ru",
      "pupok@gmail.com",
      "eliphant@rambler.ru",
      "crocodile@mail.ru",
      "mops@e1.ru"
    ],
    "avatarImages": [
      "fish.jpg",
      "mouse.jpg",
      "pupok.jpg",
      "eliphant.jpg",
      "crocodile.jpg",
      "mops.jpg"
    ],
    "passwords" : [
      "1111",
      "2222",
      "3333",
      "4444",
      "5555",
      "6666"
    ],
    "posters": [
      "green-mile.jpg",
      "shindler.jpg",
      "redemption.jpg",
      "gump.jpg",
      "king.jpg",
      "mystery.jpg"
    ],
    "backgroundImages": [
      "mile.jpg",
      "list.jpg",
      "shawshank.jpg",
      "forest.jpg",
      "ring,jpg",
      "coco.jpg"
    ],
    "backgroundColors": [
      "black",
      "white",
      "brown",
      "green",
      "red",
      "blue"
    ]
  }
}
